{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2025-11-16T14:52:33.871738Z",
     "start_time": "2025-11-16T14:52:33.867024Z"
    }
   },
   "source": [
    "'''\n",
    "Напишите программу, которая симулирует лотерею:\n",
    "\n",
    "Генерирует список из 50 случайных чисел от 1 до 100.\n",
    "Перемешивает его.\n",
    "Выбирает 5 случайных чисел без повторений.\n",
    "Выводит результат на экран.\n",
    "'''\n",
    "from random import randint, shuffle, sample\n",
    "\n",
    "kucha = []\n",
    "[kucha.append(randint(1, 100)) for _ in range(100)]\n",
    "shuffle(kucha)\n",
    "\n",
    "print(sample(kucha, 5))\n",
    "\n",
    "\n"
   ],
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[19, 2, 53, 25, 75]\n"
     ]
    }
   ],
   "execution_count": 1
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "'''\n",
    "Напишите программу, которая:\n",
    "\n",
    "Создаёт папку test_directory, если её нет.\n",
    "Внутри создаёт файл info.txt и записывает туда строку \"Этот файл создан автоматически.\"\n",
    "Проверяет, существует ли файл.\n",
    "Если существует – считывает его содержимое и выводит в консоль.\n",
    "'''\n",
    "from pathlib import\n",
    "\n",
    "p = './test_directory'\n",
    "if"
   ],
   "id": "d5329fc46e61414f"
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
